{"English":"Passing Props to a Component Props let you think about parent and child components independently. For example, you can change the person or the size props inside Profile without having to think about how Avatar uses them. Similarly, you can change how the Avatar uses these props, without looking at the Profile.","Tamil":"ஒரு component-க்கு props அனுப்புதல் props மூலம் parent மற்றும் children componentகளை தனித்தனியாக யோசிக்க முடியும். எடுத்துக்காட்டாக, Profile இல் உள்ள person அல்லது size propsகளை நீங்கள் மாற்றலாம், அவற்றை Avatar எப்படி பயன்படுத்துகிறது என்பதைக் கவனிக்காமல். அதுபோல, Avatar இவை எப்படி பயன்படுத்துகிறது என்பதையும் மாற்றலாம், Profile ஐப் பார்க்காமல்."}
{"English":"Defining a component Traditionally when creating web pages, web developers marked up their content and then added interaction by sprinkling on some JavaScript. This worked great when interaction was a nice-to-have on the web. Now it is expected for many sites and all apps. React puts interactivity first while still using the same technology: a React component is a JavaScript function that you can sprinkle with markup.","Tamil":"ஒரு component-ஐ வரையறுத்தல் சாதாரணமாக web pages உருவாக்கும்போது,  web developers அவர்களின் content அடையாளம் காட்டி, பிறகு சில JavaScript-ஐ சேர்த்து interaction சேர்த்தனர்.  web-இல் interaction மிகவும் தேவையான போது இது சிறப்பாக செயல்பட்டது. தற்போது பல sites-ளிலும் அனைத்து appsளிலும் இது எதிர்பார்க்கப்படுகிறது. React, அதே தொழில்நுட்பத்தைப் பயன்படுத்தினாலும் react interactivity-ஐ முதன்மையாகக் கருதுகிறது: ஒரு React component என்பது மார்க்அப் சேர்க்கக்கூடிய JavaScript function."}
{"English":"Using a component Now that you\\u2019ve defined your Profile component, you can nest it inside other components. For example, you can export a Gallery component that uses multiple Profile components.","Tamil":"ஒரு component பயன்படுத்துதல் இப்போது நீங்கள் Profile componentடை வரையறுத்துவிட்டதால், அதை மற்ற componentகளுக்குள் இடுக்கலாம். எடுத்துக்காட்டாக, பல Profile componentகளை பயன்படுத்தும் ஒரு Gallery componentடை நீங்கள் ஏற்றுமதி செய்யலாம்."}
{"English":"Manipulating the DOM with Refs In this example, itemsRef doesn\\u2019t hold a single DOM node. Instead, it holds a Map from item ID to a DOM node. The ref callback on every list item takes care to update the Map.","Tamil":"Refs கொண்டு DOM-ஐ இயற்ப்படுத்தல் இந்த எடுத்துக்காட்டில், itemsRef ஒரு தனிப்பட்ட DOM node-ஐக்கொண்டு இருக்கவில்லை. அதற்கு பதிலாக, அது ஒரு Map-ஐ items ID-க்கு DOM node-ஐ அடையாளப்படுத்துகிறது. ஒவ்வொரு பட்டியல் elementயிலும் ref callback அந்த Map-ஐ புதுப்பிக்க கவனித்துக்கொள்கிறது."}
{"English":"Forwarding props with the JSX spread syntax Sometimes, passing props gets very repetitive. There\\u2019s nothing wrong with repetitive code\\u2014it can be more legible. But at times you may value conciseness.","Tamil":"JSX spread syntaxயுடன் propsகளை அனுப்புதல் சில சமயங்களில், propsகளை அனுப்புவது மிகவும் மீண்டும் மீண்டும் இருக்கும். மீண்டும் மீண்டும் உள்ள code தவறில்லை\\u2014அது மிகவும் தெளிவாக இருக்கலாம். ஆனால் சில நேரங்களில், சுருக்கத்தை நீங்கள் நல்லதாக கருதலாம்."}
{"English":"Destructuring props Usually you don\\u2019t need the whole props object itself, so you destructure it into individual props.","Tamil":"propsகளை destructure செய்தல் பொதுவாக நீங்கள் முழு props object தேவையில்லையென்று நினைக்கலாம், ஆகவே அதை தனிப்பட்ட propsகளாக destructure செய்கிறார்கள்."}
{"English":"Specifying a default value for a prop If you want to give a prop a default value to fall back on when no value is specified, you can do it with the destructuring by putting = and the default value right after the parameter.","Tamil":"ஒரு propக்கு default value குறிப்பிடுதல் ஒரு propக்கு எந்த valueம் குறிப்பிடப்படாதபோது default value கொடுக்க விரும்பினால், parameter பிறகு = மற்றும் default value வைக்கலாம்."}
{"English":"Nesting components You can nest content inside a JSX tag, and the parent component will receive that content in a prop called children.","Tamil":"componentகளை இடுக்குதல் நீங்கள் ஒரு JSX tagல் content--ஐ nest செய்யலம், மேலும் parent component அந்த content children எனப்படும் propல் பெறும்."}
{"English":"Handling events React events are named using camelCase, rather than lowercase. With JSX, you pass a function as the event handler, rather than a string.","Tamil":"Handling events React Events lowercase ஐ பயன்படுத்தாமல் camelCase ஐப் பயன்படுத்தி பெயரிடப்படுகின்றன. JSX இல், நீங்கள் ஒரு பதிலாக ஒரு code நிகழ்வு handlerராக அனுப்புகிறீர்கள்."}
{"English":"Conditional rendering You can create distinct components that encapsulate the behavior you need. Then, you can render only some of them, depending on the state of your application.","Tamil":"Conditional rendering நீங்கள் உங்களுக்கு தேவையான நடத்தை அடங்கிய தனித்தனி componentடுகளை உருவாக்கலாம். பிறகு, உங்கள் application state பொறுத்து, சிலவற்றை மட்டுமே render செய்யலாம்."}
{"English":"Using the useState Hook The useState Hook lets you add state to functional components. Call it inside a function component to add some local state to it.","Tamil":"useState hook பயன்படுத்துதல் useState hook functional componentகளில் stateயைச் சேர்க்க அனுமதிக்கிறது. ஒரு functional componentடின் உள்ளே அதை அழைத்து சில local stateயை அதில் சேர்க்கவும்."}
{"English":"Using the useEffect Hook The useEffect Hook lets you perform side effects in your function components. It's like componentDidMount, componentDidUpdate, and componentWillUnmount combined.","Tamil":"useEffect hook பயன்படுத்துதல் useEffect hook உங்கள் functional componentடுகளில் பக்க விளைவுகளைச் செய்ய அனுமதிக்கிறது. இது componentDidMount, componentDidUpdate, மற்றும் componentWillUnmount ஐச் சேர்க்கிறது."}
{"English":"Rendering lists You can build collections of elements and include them in JSX using curly braces {}. Use the map() function to transform an array of data into an array of elements.","Tamil":"list render செய்தல் உங்களை நீங்கள் curly braces {} பயன்படுத்தி JSX இல் உள்ளடக்கலாம். ஒரு தரவுத் தொகுப்பை ஒரு data arrayக மாற்ற map() function பயன்படுத்தவும்."}
{"English":"Keys in lists Keys help React identify which items have changed, are added, or are removed. They should be given to the elements inside the array to give the elements a stable identity.","Tamil":"Keys in lists Keys எந்த  items மாற்றப்பட்டன, சேர்க்கப்பட்டன அல்லது நீக்கப்பட்டன என்பதைக் கண்டறிய React க்கு உதவுகிறது. அவற்றின் நிலையான அடையாளத்தை வழங்க listன் உள்ளே உள்ள itemsக்கு வழங்கப்பட வேண்டும்."}
{"English":"Forms in React In HTML, form elements such as <input>, <textarea>, and <select> maintain their own state and update it based on user input. In React, mutable state is typically kept in the state property of components.","Tamil":"React இல் formsகள் HTML இல், <input>, <textarea>, மற்றும் <select> போன்ற form elements தங்களின் stateயை தக்கவைத்துக்கொண்டு, user inputடை அடிப்படையாகக் கொண்டு அதை புதுப்பிக்கின்றன. React இல், மாறக்கூடிய state பொதுவாக componentடின் state வைத்திருக்கும்."}
{"English":"Controlled Components In React, a controlled component is an input element whose value is controlled by the state of the component. For example, a form input that is controlled by the state of the component.","Tamil":"Controlled Components React இல், Controlled component என்பது அதன் value componentடின் state மூலம் கட்டுப்படுத்தப்படும் input element. எடுத்துக்காட்டாக, componentடின் state மூலம் கட்டுப்படுத்தப்படும்"}
{"English":"Uncontrolled Components\nAn uncontrolled component is an input element that is not controlled by the state of the component. Instead, it maintains its own internal state.\n","Tamil":"Uncontrolled Components\nUncontrolled Components என்பது componentடின் state மூலம் கட்டுப்படுத்தப்படாத input element. இதற்கு பதிலாக, இது தனது சொந்த உள்state stateயை தக்கவைத்துக் கொள்கிறது.\n"}
{"English":"Handling form submission\nTo handle form submission, you can define a function that handles the event and then pass it as the `onSubmit` prop to the form element.\n","Tamil":"form submission கையாளுதல்\nform submission கையாள, event கையாளும் function வரையறுக்கலாம், பின்னர் அதை `onSubmit` prop ஆக form elementக்கு அனுப்பலாம்.\n"}
{"English":"Lifting state up\nTo share state between two components, move it up to their closest common ancestor. This is called “lifting state up”.\n","Tamil":"stateயை உயர்த்தல்\nஇரண்டு componentகளுக்கு இடையே state ஐப் பகிர்ந்து கொள்ள, அதை அவற்றின் மிக அருகிலுள்ள பொதுவான ancestor componentக்கு நகர்த்தவும். இதை \"stateயை உயர்த்துதல்\" என்று அழைக்கப்படுகிறது\n"}
{"English":"Composition vs Inheritance\nReact has a powerful composition model, and we recommend using composition instead of inheritance to reuse code between components.\n","Tamil":"Composition vs Inheritance\nReact க்கு ஒரு சக்திவாய்ந்த composition model உள்ளது, மேலும் componentகளிடையே code மறுபயன்பாடு செய்ய Inheritance பதிலாக composition பயன்படுத்த பரிந்துரை செய்கிறோம்.\n\n"}
{"English":"Conditional rendering with `&&`\nYou can use JavaScript’s `&&` operator to conditionally include an element. This works because in JavaScript, `true && expression` always evaluates to `expression`, and `false && expression` always evaluates to `false\n","Tamil":"`&&` உடன் Conditional rendering \nஒரு elementயை Conditionalக உள்ளடக்க JavaScript இன் `&&` operator பயன்படுத்தலாம். JavaScript இல், `true && expression` எப்போதும் `expression` ஆக மதிப்பீடு செய்யும், மற்றும் `false && expression` எப்போதும் `false` ஆக மதிப்பீடு செய்யும்.\n"}
{"English":"Preventing component re-renders\nReact will re-render a component if its props or state change. To prevent unnecessary re-renders, ensure that the state or props do not change unless necessary.\n","Tamil":"component re-renders தடுக்குதல்\nReact அதன் props அல்லது state மாறினால் ஒரு componentடை re-renders செய்யும். தேவையற்ற re-renders தடுக்க, state அல்லது propsகள் தேவையற்றால் மட்டுமே மாறாதவாறு உறுதி செய்யவும்.\n"}
{"English":"The `useRef` Hook\nThe `useRef` Hook is a function that returns a mutable ref object whose `.current` property is initialized to the passed argument (`initialValue`).\n","Tamil":"`useRef` hook\n`useRef` hook என்பது ஒரு செயல்பாடு, இது அதன் `.current` property வழங்கப்பட்ட கட்டளைக்கு (`initialValue`) Initialized செய்யப்பட்ட ஒரு மாறக்கூடிய ref objectத் திரும்ப அளிக்கிறது.\n"}
{"English":"Avoiding prop drilling\nProp drilling is when you pass data through many layers of components just to get it to a deeply nested component. This can make your code harder to maintain.\n","Tamil":"prop drilling தவிர்ப்பது\nprop drilling என்பது ஒரு ஆழமாக nested componentடுக்கு data பெறுவதற்காக பல layers வழியாக data அனுப்புவதாகும். இது உங்கள் code பராமரிக்க கடினமாக்கும்.\n"}
{"English":"Context API\nThe Context API provides a way to pass data through the component tree without having to pass props down manually at every level.\n","Tamil":"Context API\nContext API, ஒவ்வொரு மட்டத்திலும் propsகளை வழக்கம் போல் அனுப்பாமல், component tree வழியாக data அனுப்ப ஒரு வழியை வழங்குகிறது.\n"}
{"English":"Error Boundaries\nError boundaries are React components that catch JavaScript errors anywhere in their child component tree, log those errors, and display a fallback UI.\n","Tamil":"Error Boundaries\nError Boundaries என்பது React componentடுகள், அவற்றின் children component tree எங்கேனும் Javascript errorகளைப் பிடித்து, அந்த errorகளை பதிவுசெய்து, ஒரு fallback UIஐக் காட்டும்.\n"}
{"English":"React.memo\n`React.memo` is a higher order component that memoizes the result of a function component, preventing it from re-rendering unless its props have changed.\n","Tamil":"React.memo\n`React.memo` என்பது ஒரு higher order component, இது ஒரு functional componentடின் முடிவுகளை நினைவாக வைத்துக்கொண்டு, அதன் propsகள் மாறியவரை re-rendering செய்யாமல் தடுக்கிறது.\n"}
{"English":"Code-Splitting\nCode-splitting is a feature supported by bundlers like Webpack, which can create multiple bundles that can be loaded on demand, improving performance.\n","Tamil":"Code-Splitting\nCode-Splitting என்பது Webpack போன்ற bundlersகளால் ஆதரிக்கப்படும் ஒரு அம்சம், இது பல bundles உருவாக்கி, தேவைப்படும் பொழுது load ஆகிறது, performance மேம்படுத்துகிறது.\n"}
{"English":"Lazy Loading\nLazy loading is a design pattern that loads parts of your application only when they are needed. In React, you can use `React.lazy` to lazy load components.\n","Tamil":"Lazy Loading\nLazy Loading என்பது உங்கள் application பகுதிகளை அவை தேவையான போது மட்டுமே load ​​செய்யும் design முறை. React இல், நீங்கள் `React.lazy` ஐ பயன்படுத்தி componentகளை Lazy Load செய்யும்\n"}
{"English":"React Router\nReact Router is a standard library for routing in React. It enables the navigation among views of various components in a React Application, allows changing the browser URL, and keeps UI in sync with the URL.\n","Tamil":"React Router\nReact Router என்பது React இல் routing செலுத்துவதற்கான ஒரு stateயான library. இது React Applicationல் பல componentகளின் view இடையே வழிசெலுத்தலை சுலபமாக்குகிறது, browser URL ஐ மாற்ற அனுமதிக்கிறது, மேலும் UI ஐ URL உடன் ஒருங்கிணைக்கிறது.\n"}
{"English":"React PureComponent\nPureComponent is a base class in React that performs a shallow comparison of props and state, preventing unnecessary re-renders.\n","Tamil":"React PureComponent\nPureComponent என்பது React இல் ஒரு அடிப்படை class, இது props மற்றும் state க்கான மேல் மட்ட ஒப்பீட்டைச் செய்யும், தேவையற்ற re-renders தடுக்கும்.\n"}
{"English":"React Concurrent Mode\nConcurrent Mode is a set of new features in React that help applications stay responsive and gracefully adjust to the user’s device capabilities and network speed.\n","Tamil":"React Concurrent Mode\nConcurrent Mode என்பது React இல் உள்ள புதிய அம்சங்களின் தொகுப்பாகும், இது applications responsive ஆக வைக்கவும்  user’s device மற்றும் நெட்வொர்க் network தகுந்தவாறு சீராக சரிசெய்யவும் உதவுகிறது.\n"}
{"English":"Using the React Profiler\nThe React Profiler helps you understand how your React application renders and tracks its performance.\n","Tamil":"React Profiler ஐ பயன்படுத்துதல்\nReact Profiler உங்கள் React application எப்படி renders செய்யப்படுகிறது மற்றும் அதன் performance எவ்வாறு கண்காணிக்கிறது என்பதைப் புரிந்து கொள்ள உதவுகிறது.\n"}
{"English":"Server-Side Rendering with React\nServer-Side Rendering (SSR) is a technique where your React components are rendered on the server and the resulting HTML is sent to the client.\n","Tamil":"React உடன் Server-Side Rendering\nServer-Side Rendering (SSR) என்பது ஒரு technique, இதில் உங்கள் React components serverல் render செய்யப்படும் மற்றும் அதற்கான HTML client அனுப்பப்படும்.\n"}
{"English":"React Refs for DOM Access\nRefs provide a way to access DOM nodes or React elements created in the render method.\n","Tamil":"React Refs for DOM Access\nRefs மூலம் render methodல் உருவாக்கப்பட்ட DOM nodes அல்லது React elementகளை அணுகுவதற்கான வழியை வழங்குகிறது.\n"}
{"English":"React Portals\nPortals provide a way to render children into a DOM node that exists outside the DOM hierarchy of the parent component.\n","Tamil":"React Portals\nPortals மூலம் children parent component DOM வரிசையில் இல்லாத DOM node ஒன்றில் ரெண்டர் செய்வதற்கான வழியை வழங்குகிறது.\n"}
{"English":"React's Virtual DOM\nReact's virtual DOM is a lightweight copy of the actual DOM that allows for efficient updates and rendering.\n","Tamil":"React இன் Virtual DOM\nReact இன் virtual DOM என்பது உண்மையான DOM இன் எடை குறைந்த copy, இது efficient updatesகும் renderகும் அனுமதிக்கிறது.\n"}
{"English":"React DevTools Extension\nReact DevTools is a browser extension that provides a set of utilities to inspect the React component hierarchy and state.\n","Tamil":"React DevTools Extension\nReact DevTools என்பது React component வரிசை மற்றும் state ஐ ஆய்வு செய்ய உதவும் browser extension.\n"}
{"English":"Using Fragments in React\nReact Fragments let you group a list of children without adding extra nodes to the DOM.\n","Tamil":"React இல் Fragments பயன்படுத்துதல்\nReact Fragments கூடுதல் nodes ஐ DOM இல் சேர்க்காமல் list of childrenஐ குழுவாக இணைக்க அனுமதிக்கின்றன.\n"}
{"English":"Higher-Order Components\nA higher-order component (HOC) is an advanced technique in React for reusing component logic. HOCs are not part of the React API, but a pattern that emerges from React’s compositional nature.\n","Tamil":"Higher-Order Components\nHigher-Order Components (HOC) என்பது React இல் component logic ஐ மீண்டும் பயன்படுத்த advanced technique. HOCs React API இல் ஒரு பகுதி அல்ல, ஆனால் React இன் compositional nature தோன்றும் ஒரு pattern.\n"}
{"English":"Creating a Context\nTo create a new context, use `React.createContext`. This will create a `Context` object that you can use to pass data through the component tree.\n","Tamil":"ஒரு Context உருவாக்குதல்\nஒரு புதிய context உருவாக்க, `React.createContext` ஐ பயன்படுத்தவும். இது ஒரு `Context` object உருவாக்கும், இது component tree மூலம் dataகளை அனுப்ப பயன்படுத்தலாம்.\n"}
{"English":"Rendering Multiple Components\nYou can build encapsulated components that manage their own state, and then compose them to make complex UIs.\n","Tamil":"பல componentகளை render செய்தல்\nஉங்கள் stateயை நிர்வகிக்கும் encapsulated componentகளை உருவாக்கலாம், பிறகு அவற்றைச் சேர்த்து சிக்கலான UI-களை உருவாக்கலாம்.\n"}
{"English":"Sharing State Between Components\nTo share state between components, you can lift the state up to their closest common ancestor. This way, the state will be managed in one place and passed down via props.\n","Tamil":"componentகள் இடையே stateயைப் பகிர்வு செய்தல்\ncomponentகள் இடையே stateயைப் பகிர, நீங்கள் stateயை அவர்களின் மிக நெருக்கமான பொதுவான ancestorக்கு உயர்த்தலாம். இந்த வழியில், state ஒரு இடத்தில் நிர்வகிக்கப்படும் மற்றும் propsகள் மூலம் கீழே அனுப்பப்படும்.\n"}
{"English":"Using the useReducer Hook\nThe `useReducer` Hook is usually preferable to `useState` when you have complex state logic that involves multiple sub-values or when the next state depends on the previous one.\n","Tamil":"`useReducer` hook பயன்படுத்துதல்\nபல துணை valueகளை உள்ளடக்கிய சிக்கலான state logic உங்களுக்கு இருக்கும் போது அல்லது அடுத்த state previous one மீது சார்ந்திருக்கும் போது `useState` ஐ விட `useReducer` hook பொதுவாக விருப்பமானதாக இருக்கும்.\n"}
{"English":"Using Memoization in React\nMemoization is an optimization technique that can help improve performance by caching the results of expensive function calls and reusing those cached results when the same inputs occur again.\n","Tamil":"React இல் Memoization பயன்படுத்துதல்\nMemoization என்பது optimization தொழில்நுட்பமாகும், இது expensive function calls முடிவுகளை சேமித்து, அதே inputகள் மீண்டும் நிகழும் போது அந்த சேமிக்கப்பட்ட முடிவுகளை மீண்டும் பயன்படுத்த உதவுகிறது.\n"}
{"English":"Optimizing Performance\nTo optimize the performance of a React application, you can use techniques like code splitting, lazy loading, and memoization.\n","Tamil":"performance மேம்படுத்துதல்\nReact application performance மேம்படுத்த, code splitting, lazy loading மற்றும் memoization போன்ற தொழில்நுட்பங்களைப் பயன்படுத்தலாம்.\n"}
{"English":"Error Boundaries\nError boundaries are React components that catch JavaScript errors anywhere in their child component tree, log those errors, and display a fallback UI instead of crashing the whole component tree.\n","Tamil":"Error Boundaries\nError Boundaries என்பது React componentகள், அவை அவர்களின் children component tree எந்த இடத்திலும் JavaScript errorகளைப் பிடித்து, அவற்றை பதிவு செய்து, மொத்த component tree வீழ்த்தாமல் மாறுதலான UIஐக் காட்டுகின்றன.\n"}
{"English":"Forwarding Refs\nRef forwarding is a technique for automatically passing a ref through a component to one of its children.\n","Tamil":"Forwarding Refs\nRef forwarding  அனுப்புதல் என்பது ஒரு component மூலம் ref ஐ தானாகவே அதன் childrenகளில் ஒன்றுக்கு அனுப்புவதற்கான தொழில்நுட்பமாகும்.\n"}
{"English":"Context Provider\nA context provider allows consuming components to subscribe to context changes. You use a context provider to pass down context to components in the tree.\n","Tamil":"Context Provider\nContext Provider context மாற்றங்களுக்கு subscribe செய்ய consuming componentகளை அனுமதிக்கின்றார். componentகள் treeல் context ஐ வழங்க context provider பயன்படுத்துகிறீர்கள்.\n"}
{"English":"Using the useContext Hook\nThe `useContext` Hook lets you access the context value directly from within a functional component.\n","Tamil":"`useContext` hook பயன்படுத்துதல்\n`useContext` hook மூலம் ஒரு functional componentடின் உள்ளே context value நேரடியாக அணுகலாம்.\n"}
{"English":"Suspense in React\nSuspense lets your components wait for something before they can render. It can be used to handle lazy-loaded components or data fetching.\n","Tamil":"React இல் Suspense\nSuspense மூலம் உங்கள் componentகள் render செய்யுமுன் சிலவற்றுக்காகக் காத்திருக்க முடியும். இது lazy-loaded componentகளை அல்லது data fetching கையாள பயன்படுத்தப்படலாம்.\n"}
{"English":"Lazy Loading in React\nLazy loading is a technique to defer loading of components until they are needed. This can improve the initial load time of the application.\n","Tamil":"React இல் Lazy Loading\nLazy loading என்பது தேவையில்லாத componentகளின் ஏற்றத்தை ஒத்திவைக்கும் தொழில்நுட்பமாகும். இது application ஆரம்ப ஏற்ற நேரத்தை மேம்படுத்த முடியும்.\n"}
{"English":"React Profiler\nThe React Profiler API allows you to collect timing information about each component rendering. This helps in identifying performance bottlenecks in your application.\n","Tamil":"React Profiler\nReact Profiler API மூலம் ஒவ்வொரு component rendering நேர விவரங்களைச் சேகரிக்க முடியும். இது உங்கள் application செயல்திறன் bottlenecksஐ கண்டறிய உதவுகிறது.\n"}
{"English":"Creating Custom Hooks\nCustom Hooks let you extract component logic into reusable functions. They start with `use` as a convention and can call other Hooks.\n","Tamil":"Custom hookகுகளை உருவாக்குதல்\nCustom hookகுகள் மூலம் component logic ஐ மீண்டும் reusable functionகளில் பிரிக்கலாம். அவை ஒரு மரபுக்கிணங்க `use` தொடங்கி, மற்ற hookகுகளை அழைக்கலாம்.\n"}
